---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.NotOneCurveError
source: html/98869ad4-9d68-ce5c-7993-20559ff5acbb.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.NotOneCurveError Property

More than one curve not allowed.

## Syntax (C#)
```csharp
public static FailureDefinitionId NotOneCurveError { get; }
```